In [1]:
#feature split first way

#importing libraries along with date function also
import pandas as pd
import numpy as np

In [2]:
#creating a new data wiht coumn names
data = pd.DataFrame({'name':
['raja Singh',
'sameer Padhi',
'ravi Verma',
'venkat Reddy',
'ramani Priya',
]})

In [3]:
#Extracting first names
data.name.str.split(" ").map(lambda x: x[0])

0      raja
1    sameer
2      ravi
3    venkat
4    ramani
Name: name, dtype: object

In [4]:
#Extracting last names and store in df fn
fn=data.name.str.split(" ").map(lambda x: x[-1])

In [5]:
fn

0    Singh
1    Padhi
2    Verma
3    Reddy
4    Priya
Name: name, dtype: object

In [6]:
#feature split second way string extraction

data1=pd.DataFrame({"Title":
['Toy Story (1995)',
'Jumanji (1995)',
'Grumpier Old Men (1995)',
'Waiting to Exhale (1995)',
'Father of the Bride Part II (1995)',
]})

data1

In [7]:
data1

                                Title
0                    Toy Story (1995)
1                      Jumanji (1995)
2             Grumpier Old Men (1995)
3            Waiting to Exhale (1995)
4  Father of the Bride Part II (1995)

In [8]:
data1.Title.str.split("(", n=1, expand=True)[1].str.split(")", n=1, expand=True)[0]

0    1995
1    1995
2    1995
3    1995
4    1995
Name: 0, dtype: object

In [9]:
data1

                                Title
0                    Toy Story (1995)
1                      Jumanji (1995)
2             Grumpier Old Men (1995)
3            Waiting to Exhale (1995)
4  Father of the Bride Part II (1995)